# SaveAs Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..SaveAs Method
Document Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SaveAs(String) | Saves the document to a given file path. |
| SaveAs(String, SaveAsOptions) | Saves the document to a given file path. |
| SaveAs(ModelPath, SaveAsOptions) | Saves the document to a given path. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace